grekichi/raspberry_pi_asm/rp2040/i2c/temp_humid_with_monitor/temp_humid_m.c
#include "rp2040.h"
#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>
// #include "uart.h"

void PUT32 (uint32_t, uint32_t);
uint32_t GET32 (uint32_t);
void DELAY (uint32_t);
void WFI(void);

// GPIO4(I2C0-SDA) --> SHT31のSDAに接続
// GPIO5(I2C0-SDL) --> SHT31のSDLに接続

static void clock_init(void)
{
    // 125MHzに設定する
    PUT32(CLK_SYS_RESUS_CTRL_RW, 0);  // RESUS無効化、time out を0サイクルに設定
    PUT32(XOSC_CTRL_RW, 0xAA0 | (0xFAB << 12));  // 水晶発振器を1-15MHzレンジに設定、水晶発振器enable
    PUT32(XOSC_STARTUP_RW, 0xC4);  // 256 * 196 = 50176 cycles に設定
    while (!(GET32(XOSC_STATUS_RW) & 0x80000000));  // 発振器の動作確認
    // PUT32(CLK_REF_CTRL_RW, 1 << 0);  // SRC -> CLKSRC_CLK_REF_AUX
    
    // PLL_SYSのリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_CLR, 1 << 12);  // ビット12がPLL_SYSに相当
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 12)));

    // PLL_SYSを125MHzに設定する
    PUT32(PLL_SYS_PWR_RW, (1 << 5) | (1 << 3) | (1 << 0));  // PWR 電源off
    PUT32(PLL_SYS_CS_RW, 0);  // REFDIV=1
    PUT32(PLL_SYS_FBDIV_INT_RW, 125);  // VCO=1500MHz *63に設定して、PD2=1にすると同等設定で消費電力を抑えられる
    PUT32(PLL_SYS_PWR_RW, 1 << 3);  // POSTDIVPD=1で保持
    while (!(GET32(PLL_SYS_CS_RW) & (1 << 31)));  // PLLのロック状況を確認
    PUT32(PLL_SYS_PRIM_RW, (6 << 16) | (2 << 12));  // PD1->6, PD2->2
    PUT32(PLL_SYS_PWR_RW, 0);  // Power -> on, PD=0, VCOPD=0, POSTDIVPD=0
    
    PUT32(CLK_SYS_CTRL_CLR, 1 << 0);  // SRCを一旦CLK_REF(=XOSC)に退避する 
    PUT32(CLK_SYS_CTRL_CLR, 7 << 5);  // AUXSRC 7:5bits クリア -> PLL_SYS
    PUT32(CLK_SYS_CTRL_SET, (0 << 5) | (1 << 0));  // AUXSRC -> PLL_SYS, CLKSRC_CLK_SYS_AUX

    PUT32(CLK_PERI_CTRL_CLR, 7 << 5);  // AUXSRC 7:5bits クリア -> CLK_SYS
    PUT32(CLK_PERI_CTRL_SET, (1 << 11) | (1 << 5));  // enable, CLKSRC_PLL_SYS
}

static void reset_subsys(void)
{
    // IO_BANK0のリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_CLR, 1 << 5);  // ビット５がIO_BANK0に相当
    // IO_BANK0のリセットが完了していればループを抜ける
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 5)));

    // PADS_BANK0のリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_CLR, 1 << 8);  // ビット8がPADS_BANK0に相当
    // PADS_BANK0のリセットが完了していればループを抜ける
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 8)));

    // I2C0のリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_CLR, 1 << 3);  // ビット3がI2C0に相当
    // I2C0のリセットが完了していればループを抜ける
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 3)));
}

static void led_init(void)
{
    uint32_t ra;

    PUT32(SIO_GPIO_OE_CLR, 1 << 25);  // GPIO25出力を無効化（初期化のための安全動作）
    PUT32(SIO_GPIO_OUT_CLR, 1 << 25);  // GPIO25の値をクリア
    ra = GET32(PADS_BANK0_GPIO25_RW);
    ra ^= 0x40;  // if input disabled then enable
    ra &= 0xC0;  // if output disabled then enable
    PUT32(PADS_BANK0_GPIO25_XOR, ra);
    PUT32(IO_BANK0_GPIO25_CTRL_RW, 5);  // SIO
    PUT32(SIO_GPIO_OE_SET, 1 << 25);  // GPIO25出力を有効化
}

static void uart_init(void)
{
    // uint32_t ra;

    PUT32(RESETS_RESET_CLR, (1 << 22));  // UART0のリセットを解除
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 22)));

    PUT32(UART0_BASE_UARTCR_RW, 0x00000000);  // UART初期化
    // ボーレート分周器の設定
    // 水晶発振器(XOSC)使用のため、clk_periの周波数は、125MHz = (125 * 10^6)
    // 通信速度(ボーレート)は、115200 bps に設定
    // 計算方法: clk_periの周波数 / (ボーレート * 16倍)
    // 割った結果の小数部分は、64倍した値を小数ボーレート分周値とする
    // 125000000 / (16 * 115200) = 67.8168
    // 0.8168 * 64 = 52.2752 -> + 0.5 = 52.7752
    PUT32(UART0_BASE_UARTIBRD_RW, 67);  // 整数ボーレート分周値
    PUT32(UART0_BASE_UARTFBRD_RW, 53);  // 小数ボーレート分周値
    // ボーレート57600の場合： 13.0208, 0.0208*64=1.3312 

    // 0 11 1 0 0 0 0 = (0111 0000) が設定値
    PUT32(UART0_BASE_UARTLCR_H_RW, 0x70);  // １フレームのデータビット数 8bits, FIFO有効化, パリティビットなし
    PUT32(UART0_BASE_UARTCR_RW, (1 << 9) | (1 << 8) | (1 << 0));  // TXE:有効、RXE:有効

    // ra = GET32(PADS_BANK0_GPIO0_RW);  // UART_TX
    // ra ^= 0x40;  // 0100 0000 : if input disabled then enable
    // ra &= 0xC0;  // 1100 0000 : if output disabled then enable

    // GPIO0の設定
    PUT32(PADS_BANK0_GPIO0_CLR, (1 << 7) | (1 << 6));  // OD/IE -> disable
    PUT32(PADS_BANK0_GPIO0_CLR, 1 << 2);  // Pull down disable 
    PUT32(PADS_BANK0_GPIO0_SET, 1 << 3);  // Pull up enable
    PUT32(IO_BANK0_GPIO0_CTRL_RW, 2);  // UART0_TX

    // GPIO1の設定
    PUT32(PADS_BANK0_GPIO1_SET, 1 << 6);  // IE enable
    PUT32(PADS_BANK0_GPIO1_CLR, 1 << 2);  // Pull down disable 
    PUT32(PADS_BANK0_GPIO1_SET, 1 << 3);  // Pull up enable
    PUT32(IO_BANK0_GPIO1_CTRL_RW, 2);  // UART0_RX
}

static void uart_send(uint32_t x)
{
    while (GET32(UART0_BASE_UARTFR_RW) & (1 << 5));
    PUT32(UART0_BASE_UARTDR_RW, x);
}

static void uart_send_char(uint8_t x)
{
    while (GET32(UART0_BASE_UARTFR_RW) & (1 << 5));
    PUT32(UART0_BASE_UARTDR_RW, x);
}

static void uart_send_str(uint8_t *y)
{
    while (*y != '\0')
    {
        uart_send_char(*y);
        y++;
    }
    uart_send_char('\r');
    uart_send_char('\n');
    uart_send_char('\n');
}

static inline uint32_t bin2dec(const uint8_t *bin)
{
    uint32_t val = 0;

    while (*bin) {
        if (*bin != '0' && *bin != '1') {
            return 0; // エラー処理（適宜変更）
        }
        val = (val << 1) | (*bin - '0');
        bin++;
    }
    return val;
}

static inline void int2bin8(uint8_t val, uint8_t *buf)
{
    uint8_t u = (uint8_t)val;

    for (int i = 0; i < 8; i++)
    {
        buf[i] = ((u >> (7 - i)) & 1) ? '1' : '0';
    }
    buf[8] = '\0';
}


static inline void int2bin16(uint32_t val, uint8_t *buf)
{
    uint32_t u = (uint32_t)val;

    for (int i = 0; i < 16; i++)
    {
        buf[i] = ((u >> (15 - i)) & 1) ? '1' : '0';
    }
    buf[16] = '\0';
}

static inline void int2bin32(uint32_t val, uint8_t *buf)
{
    uint32_t u = (uint32_t)val;

    for (int i = 0; i < 32; i++)
    {
        buf[i] = ((u >> (31 - i)) & 1) ? '1' : '0';
    }
    buf[32] = '\0';
}

static inline void int2str(int value, uint8_t *buf)
{
    uint8_t i = 0;

    if (value < 0)
    {
        buf[i++] = '-';
        value = -value;  // -45 -> 45 に変換
    }

    // 桁毎に処理
    int tens[] = {100, 10, 1};
    uint8_t started = 0;

    for (int j = 0; j < 3; j++)
    {
        uint8_t digit = 0;
        int v = value;

        while (v >= tens[j])
        {
            v -= tens[j];
            digit++;
        }

