grekichi/raspberry_pi_asm/rp2040/i2c/temp_humid_with_monitor/temp_humid_m.c
        if (digit > 0 || started || j == 2)
        {
            buf[i++] = digit + '0';
            value -= digit * tens[j];  // 次の桁用に減算
            started = 1;
        }
    }

    buf[i] = '\0';
}

static void monitor_init(void)
{
    PUT32(IO_BANK0_GPIO14_CTRL_RW, 5);  // SIO
    PUT32(IO_BANK0_GPIO15_CTRL_RW, 5);  // SIO

    PUT32(SIO_GPIO_OE_CLR, 1 << 14);  // GPIO14出力を無効化
    PUT32(SIO_GPIO_OE_CLR, 1 << 15);  // GPIO15出力を無効化

    PUT32(SIO_GPIO_OUT_CLR, 1 << 14);  // GPIO14の値をクリア
    PUT32(SIO_GPIO_OUT_CLR, 1 << 15);  // GPIO15の値をクリア

    PUT32(SIO_GPIO_OE_SET, 1 << 14);  // GPIO14出力を有効化
    PUT32(SIO_GPIO_OE_SET, 1 << 15);  // GPIO15出力を有効化
}

static void i2c_init(void)
{
    PUT32(I2C0_IC_ENABLE_RW, 0);  // I2C0初期化
    while (GET32(I2C0_IC_ENABLE_RW) & 1);

    /* ==========================================================
     * 1. I2C BUS RECOVERY
     *    GPIO4 = SDA, GPIO5 = SCL
     * ========================================================== */

    /* --- GPIO (SIO) 機能に切替 --- */
    PUT32(IO_BANK0_GPIO4_CTRL_RW, 5);   // FUNCSEL = SIO (GPIO)
    PUT32(IO_BANK0_GPIO5_CTRL_RW, 5);

    /* --- Pad 設定 --- */
    // 入力有効（SDA 状態確認用）
    PUT32(PADS_BANK0_GPIO4_SET, 1 << 6);
    PUT32(PADS_BANK0_GPIO5_SET, 1 << 6);

    // 内蔵 Pull-up は使わない（外付け前提）
    PUT32(PADS_BANK0_GPIO4_CLR, 1 << 3);
    PUT32(PADS_BANK0_GPIO5_CLR, 1 << 3);

    /* --- SDA: Hi-Z, SCL: 出力 --- */
    PUT32(SIO_GPIO_OE_CLR, 1 << 4);     // SDA = input (Hi-Z)
    PUT32(SIO_GPIO_OE_SET, 1 << 5);     // SCL = output

    /* SCL idle = High */
    PUT32(SIO_GPIO_OUT_SET, 1 << 5);
    DELAY(1000);  // 1us

    /* --- 9 クロック出力 --- */
    for (int i = 0; i < 9; i++) {
        PUT32(SIO_GPIO_OUT_CLR, 1 << 5);  // SCL Low
        DELAY(1000);
        PUT32(SIO_GPIO_OUT_SET, 1 << 5);  // SCL High
        DELAY(1000);
    }

    /* --- STOP 条件生成 (SDA↑ while SCL↑) --- */
    PUT32(SIO_GPIO_OUT_SET, 1 << 5);     // SCL High
    DELAY(1000);
    // SDA は OE=0 のまま → 外付け PU により High
    DELAY(1000);


    // ==========================================
    // FIFO trigger
    PUT32(I2C0_IC_TX_TL_RW, 0);
    PUT32(I2C0_IC_RX_TL_RW, 0);

    // DMA off
    PUT32(I2C0_IC_DMA_CR_RW, 0);

    // interrupt clear
    GET32(I2C0_IC_CLR_INTR_RW);

    // I2C0をマスターモード、 高速モード、7bitアドレス送信 に設定
    PUT32(
        I2C0_IC_CON_RW,
        1 << 0 |  // MASTER_MODE -> enabled
        1 << 1 |  // SPEED -> standard (*12MHz発振子ではstandardでしか動かせない)
        0 << 3 |  // IC_10BITADDR_SLAVE -> Slave 7bits addressing mode
        0 << 4 |  // IC_10BITADDR_MASTER -> Master 7bits addressing mode
        1 << 5 |  // IC_RESTART_EN -> enable
        1 << 6 |  // IC_SLAVE_DISABLE -> slave_disabled
        0 << 7 |  // STOP_DET_IFADDRESSED -> disbaled
        1 << 8 |  // TX_EMPTY_CTRL -> enabled
        0 << 9    // RX_FIFO_FULL_HLD_CTRL -> disabled
    );    
    // I2C0 標準モードのSCLクロックのHigh期間カウント
    PUT32(I2C0_IC_SS_SCL_HCNT_RW, 500);  // FSの場合、このレジスタ値は、(I2C0_IC_FS_SPKLEN_RW + 5)よりも大きくなければいけない 
    // I2C0 標準モードのSCLクロックのLow期間カウント
    PUT32(I2C0_IC_SS_SCL_LCNT_RW, 741);  // FSの場合、このレジスタ値は、(I2C0_IC_FS_SPKLEN_RW + 7)よりも大きくなければいけない
    // I2C0 スパイク抑制ロジックによってフィルタリングされる最長スパイクの持続時間
    PUT32(I2C0_IC_FS_SPKLEN_RW, 4);  // 3:32ns 4:40ns 5:48ns
    // I2C0 SDAホールド持続時間
    PUT32(I2C0_IC_SDA_HOLD_RW, 75); // 600ns 最低値は0x1

    // IO_BANK0 setting
    PUT32(IO_BANK0_GPIO4_CTRL_RW, 3);  // I2C0-SDA
    PUT32(IO_BANK0_GPIO5_CTRL_RW, 3);  // I2C0-SCL

    // Input有効化
    PUT32(PADS_BANK0_GPIO4_SET, 1 << 6);  // IE -> enable
    PUT32(PADS_BANK0_GPIO5_SET, 1 << 6);  // IE -> enable

    // I2C0を有効化
    PUT32(I2C0_IC_ENABLE_RW, 1);
}

static inline int read_i2c(const uint8_t address, uint8_t cmd_msb,
     uint8_t cmd_lsb, uint8_t *data)
{
    // TX_FIFOが空くのを確認(TFE -> 0x1)
    while (!(GET32(I2C0_IC_STATUS_RW) & (1 << 2)));

    // ABORT/STOPクリア
    GET32(I2C0_IC_CLR_TX_ABRT_RW);
    GET32(I2C0_IC_CLR_STOP_DET_RW);
    // 割り込み・ABORT完全クリア
    GET32(I2C0_IC_CLR_INTR_RW);

    PUT32(I2C0_IC_ENABLE_RW, 0);
    while (GET32(I2C0_IC_ENABLE_RW) & 1);
    PUT32(I2C0_IC_TAR_RW, address & 0x7F);
    PUT32(I2C0_IC_ENABLE_RW, 1);  // データ読み込み前に必ずこのレジスタをenableに設定すること
    DELAY(5000);  // 40μs待ち
    
    // コマンド読み込み
    uint8_t command[2] = {cmd_msb, cmd_lsb};

    uint32_t i;
    for (i = 0; i < 2; i++)
    {
        uint32_t cmd = command[i];  
        
        // 最初のバイト
        if (i == 0)
        {
            cmd |= (0 << 10);  // STARTを促す
            cmd |= (0 <<  9);
        }
        // 最後のバイト → STOP
        if (i == 1)
        {
            cmd |= (1 <<  9);
        }

        PUT32(I2C0_IC_DATA_CMD_RW, cmd);
        // uart_send_str("data pre-write complete");

        // TX_TLのしきい値以下確認（CON設定上、実質０確認となる）
        while(!(GET32(I2C0_IC_RAW_INTR_STAT_RW) & (1 << 4)));  // TX_EMPTY

        // ABORT確認
        uint8_t log[33];
        bool abort = false;
        uint32_t abort_reason = GET32(I2C0_IC_TX_ABRT_SOURCE_RW);
        if (abort_reason != 0)
        {
            int2bin32(abort_reason, log);
            uart_send(0x23);  // DEBUG #
            uart_send_str(log);  // ログ出力
            GET32(I2C0_IC_CLR_TX_ABRT_RW);  // ABORTデータクリア
            abort = true;
            // 発生ABORTチェック
            if (abort_reason & (1 << 0))
            {
                uart_send_str("Write Com_msb NoAck !");  // DEBUG
            }
            if (abort_reason & (1 << 3))
            {
                uart_send_str("Write Com_lsb NoAck !");  // DEBUG 
            }

            // STOP_DET割り込みがアクティブになるのを確認
            while (!(GET32(I2C0_IC_RAW_INTR_STAT_RW) & (1 << 9)));
            GET32(I2C0_IC_CLR_STOP_DET_RW);
            
            return -2;  // NOACK発生
        }
        if (abort) break;  // Abort発生したら書き込みストップ
    }

    // STOP_DET割り込みがアクティブになるのを確認
    while (!(GET32(I2C0_IC_RAW_INTR_STAT_RW) & (1 << 9)));
    GET32(I2C0_IC_CLR_STOP_DET_RW);
    
    uint32_t cnt;
    for (cnt = 0; cnt < 6; cnt++)
    {
        bool firstByte = (cnt == 0 ? true : false);
        bool lastByte = (cnt == 5 ? true : false);
 
