grekichi/raspberry_pi_asm/rp2040/i2c/temp_humid_with_monitor/temp_humid_m.c
        PUT32(
            I2C0_IC_DATA_CMD_RW,
            ((firstByte ? 1 : 0) << 10) |  // RESTART -> 最初のみenable, 後はdisabled
            ((lastByte  ? 1 : 0) <<  9) |  // STOP -> enable、最後のみdisable
            (1 << 8)                       // COMMAND -> read
        );

        // uart_send_str("before RXFLR");
        while (GET32(I2C0_IC_RXFLR_RW) == 0);  // RXFLRゼロ確認
        // データ書き出し
        data[cnt] = GET32(I2C0_IC_DATA_CMD_RW) & 0xFF; // DATのデータ(下8桁)のみ取得
        // uart_send_str("Get result data");
    }
    
    // STOP_DET割り込みがアクティブになるのを確認
    while (!(GET32(I2C0_IC_RAW_INTR_STAT_RW) & (1 << 9)));
    GET32(I2C0_IC_CLR_STOP_DET_RW);

    return 0;
}

// スレーブデバイスへの書き込み関数
static inline int write_i2c(const uint8_t address, uint8_t comMsb, uint8_t comLsb)
{
    // TX_FIFOが空くのを確認(TFE -> 0x1)
    while (!(GET32(I2C0_IC_STATUS_RW) & (1 << 2)));

    // ABORT/STOPクリア
    GET32(I2C0_IC_CLR_TX_ABRT_RW);
    GET32(I2C0_IC_CLR_STOP_DET_RW);
    // 割り込み・ABORT完全クリア
    GET32(I2C0_IC_CLR_INTR_RW);

    PUT32(I2C0_IC_ENABLE_RW, 0);
    while (GET32(I2C0_IC_ENABLE_RW) & 1);
    PUT32(I2C0_IC_TAR_RW, address & 0x7F);
    PUT32(I2C0_IC_ENABLE_RW, 1);  // データ読み込み前に必ずこのレジスタをenableに設定すること
    DELAY(5000);  // 40μs待ち

    // コマンド読み込み
    uint8_t data[2] = {comMsb, comLsb};

    uint32_t i;
    for (i = 0; i < 2; i++)
    {
        uint32_t cmd = data[i];  
        
        // 最初のバイト
        if (i == 0)
        {
            cmd |= (0 << 10);
            cmd |= (0 <<  9);
        }
        // 最後のバイト → STOP
        if (i == 1)
        {
            cmd |= (1 <<  9);
        }

        PUT32(I2C0_IC_DATA_CMD_RW, cmd);

        // TX_TLのしきい値以下確認（CON設定上、実質０確認となる）
        while(!(GET32(I2C0_IC_RAW_INTR_STAT_RW) & (1 << 4)));  // TX_EMPTY

        // ABORT確認
        uint8_t log[33];
        bool abort = false;
        uint32_t abort_reason = GET32(I2C0_IC_TX_ABRT_SOURCE_RW);
        if (abort_reason != 0)
        {
            int2bin32(abort_reason, log);
            uart_send(0x23);  // DEBUG #
            uart_send_str(log);  // ログ出力
            GET32(I2C0_IC_CLR_TX_ABRT_RW);  // ABORTデータクリア
            abort = true;
            // 発生ABORTチェック
            if (abort_reason & (1 << 0))
            {
                uart_send_str("Write ComMsb NoAck !");  // DEBUG 
            }
            if (abort_reason & (1 << 3))
            {
                uart_send_str("Write ComLsb NoAck !");  // DEBUG 
            }

            // STOP_DET割り込みがアクティブになるのを確認
            while (!(GET32(I2C0_IC_RAW_INTR_STAT_RW) & (1 << 9)));
            GET32(I2C0_IC_CLR_STOP_DET_RW);

            return -1;  // 書込失敗
        }
        if (abort) break;
    }

    return 0;  // 成功
}

// モニターデバイスへの制御書き込み関数
static inline int write_i2c_cont(const uint8_t address, uint8_t control, uint8_t command)
{
    // TX_FIFOが空くのを確認(TFE -> 0x1)
    while (!(GET32(I2C0_IC_STATUS_RW) & (1 << 2)));

    // ABORT/STOPクリア
    GET32(I2C0_IC_CLR_TX_ABRT_RW);
    GET32(I2C0_IC_CLR_STOP_DET_RW);
    // 割り込み・ABORT完全クリア
    GET32(I2C0_IC_CLR_INTR_RW);

    PUT32(I2C0_IC_ENABLE_RW, 0);
    while (GET32(I2C0_IC_ENABLE_RW) & 1);
    PUT32(I2C0_IC_TAR_RW, address & 0x7F);
    PUT32(I2C0_IC_ENABLE_RW, 1);  // データ読み込み前に必ずこのレジスタをenableに設定すること

    // コマンド読み込み
    uint32_t timeout;
    uint8_t input[2] = {control, command};
    
    uint32_t i;
    for (i = 0; i < 2; i++)
    {
        uint32_t cmd = input[i];  
        
        // 最後のバイト → STOP
        if (i == 1)
        {
            cmd |= (1 <<  9);
        }

        // // TFNF待ち
        // timeout = 100000;
        // while(!(GET32(I2C0_IC_STATUS_RW) & (1 << 1)))
        // {
        //     if (--timeout == 0)
        //         return -1;
        // }

        PUT32(I2C0_IC_DATA_CMD_RW, cmd);

        // // TX_FIFOの空き待つ
        // timeout = 100000;
        // while(!(GET32(I2C0_IC_STATUS_RW) & (1 << 2)))  // TFE
        // {
        //     if (--timeout == 0)
        //         return -2;  // TX空き待ちタイムアウト
        // }

        // TX_TLのしきい値以下確認（CON設定上、実質０確認となる）
        while(!(GET32(I2C0_IC_RAW_INTR_STAT_RW) & (1 << 4)));  // TX_EMPTY

        // ABORT確認
        bool abort = false;
        uint32_t abort_reason = GET32(I2C0_IC_TX_ABRT_SOURCE_RW);
        if (abort_reason != 0)
        {
            uint8_t log[33];
            int2bin32(abort_reason, log);
            uart_send(0x23);        // DEBUG #
            uart_send_str(log);     // ログ出力
            GET32(I2C0_IC_CLR_TX_ABRT_RW);  // ABORTデータクリア
            abort = true;
            // 発生ABORTチェック
            if (abort_reason & (1 << 0))
            {
                uart_send_str("Write Control NoAck !");  // DEBUG
            }
            if (abort_reason & (1 << 3))
            {
                uart_send_str("Write Command NoAck !");  // DEBUG
            }

            // STOP_DET割り込みがアクティブになるのを確認
            while (!(GET32(I2C0_IC_RAW_INTR_STAT_RW) & (1 << 9)));
            GET32(I2C0_IC_CLR_STOP_DET_RW);

            return -3;  // NOACK発生
        }
        if (abort) break;
    }

    return 0;
}


volatile uint32_t systick_ms = 0;
void Systick_Handler(void)
{
    systick_ms++;
    if (systick_ms >= 1000)
    {
        systick_ms = 0;
        PUT32(SIO_GPIO_OUT_XOR, 1 << 25);  // GPIO25出力を切替
    }
}


int temp_humid_m(void)
{
    clock_init();
    reset_subsys();
    led_init();
    monitor_init();
    i2c_init();
    // clk_periの有効待ち
    while (!(GET32(CLK_PERI_CTRL_RW) & (1 << 11)));
    uart_init();
    // °C

    PUT32(SYST_RVR, 125000-1);  // 125MHz設定のため、1msカウントにセット（1s設定できないため）
    PUT32(SYST_CVR, 0);  // 125MHz設定のため、1msカウントにセット（1s設定できないため）
    PUT32(SYST_CSR, 0x07);  // プロセッサクロック使用、例外ステータス保留、カウンター有効

    uint8_t recieve_data[6];  // センサーからの受信データ入れ物

    uint8_t buf_temp1[6];
    uint8_t buf_temp2[6];
    uint8_t buf_humid[6];

    uint8_t bin1[9];
    uint8_t bin2[9];
    uint8_t bin3[9];

    // 各スレーブアドレス
    const uint8_t sensor_addr = 0x45; // センサーのスレーブアドレス
    const uint8_t monitor_addr = 0x3E;  // モニターのスレーブアドレス

    // // SHT31初期化コード
    // static const uint8_t sht_data[] = {
    //     0x30, 0xA2,  // ソフトリセット
    //     0x30, 0x66,  // ヒーター停止
    //     0x30, 0x41   // ステータスレジスタのデータ消去
    // };

