grekichi/raspberry_pi_asm/rp2040/i2c/temp_humid_with_monitor/temp_humid_m.c
    // // AQM0802初期化コード前半
    // static const uint8_t moni_init_data1[] = {
    //     0x38,  // Function set -> 8bit bus, 2-line display
    //     0x39,  // Function set -> (IS tabel = 1) 拡張機能セット
    //     0x14,  // 内蔵発振器の周波数設定 -> bias: 1/5, F2=1: 183Hz(3.0Vの場合)
    //     0x70,  // コントラスト設定(Low byte) -> ?
    //     0x56,  // Power,ICONコントロール,コントラスト設定(High byte) -> booster on
    //     0x6C   // フォロワー制御 -> 内部フォロワー回路on
    // };

    // // AQM0802r初期化コード後半
    // static const uint8_t moni_init_data2[] = {
    //     0x38,  // Function set ->  標準セット戻し
    //     0x0C,  // ディスプレイ制御 -> ディスプレイon
    //     0x01   // ディスプレイクリア
    // };

    // AQM0802初期設定
    PUT32(SIO_GPIO_OUT_SET, 1 << 15);  // ディスプレイ RESET
    DELAY(5000000);  // 40ms待機
    uart_send_str("Monitor Init 1");
    uart_send_str("1-1");  // DEBUG 1
    write_i2c(monitor_addr, 0x00, 0x38);  // Function set -> 8bit bus, 2-line display
    DELAY(5000);  // 40μs待機
    uart_send_str("1-2");  // DEBUG 2
    write_i2c(monitor_addr, 0x00, 0x39);  // Function set -> (IS tabel = 1) 拡張機能セット
    DELAY(5000);  // 40μs待機
    uart_send_str("1-3");  // DEBUG 3
    write_i2c(monitor_addr, 0x00, 0x14);  // @内蔵発振器の周波数設定 -> bias: 1/5, F2=1: 183Hz(3.0Vの場合)
    DELAY(5000);  // 40μs待機
    uart_send_str("1-4");  // DEBUG 4
    write_i2c(monitor_addr, 0x00, 0x73);  // コントラスト設定(Low byte) -> ?
    DELAY(5000);  // 40μs待機
    uart_send_str("1-5");  // DEBUG 5
    write_i2c(monitor_addr, 0x00, 0x56);  // @Power,ICONコントロール,コントラスト設定(High byte) -> booster on    
    DELAY(5000);  // 40μs待機
    uart_send_str("1-6");  // DEBUG 6
    write_i2c(monitor_addr, 0x00, 0x6C);  // @フォロワー制御 -> 内部フォロワー回路on
    DELAY(25000000);  // 200ms待機

    uart_send_str("Monitor Init 2");
    uart_send_str("2-1");  // DEBUG 1
    write_i2c(monitor_addr, 0x00, 0x38);  // @Function set ->  標準セット戻し
    DELAY(5000);  // 40μs待機
    uart_send_str("2-2");  // DEBUG 2
    write_i2c(monitor_addr, 0x00, 0x0C);  // @ディスプレイ制御 -> ディスプレイon
    DELAY(5000);  // 40μs待機
    uart_send_str("2-3");  // DEBUG 3
    write_i2c(monitor_addr, 0x00, 0x01);  // ディスプレイクリア
    DELAY(125000);  // 1ms待機

    // STH31初期化
    uart_send_str("Reset soft");
    write_i2c(sensor_addr, 0x30, 0xA2);  // ソフトリセット
    uart_send_str("Stop heater");
    write_i2c(sensor_addr, 0x30, 0x66);  // ヒーター停止
    uart_send_str("Delete register data");
    write_i2c(sensor_addr, 0x30, 0x41);  // @ステータスレジスタのデータ消去

    PUT32(SIO_GPIO_OUT_SET, 1 << 14);  // モニター照明ON

    while (1)
    {
        WFI();

        // SHT31からのデータ受信
        uart_send_str("Sensor read start ...");           // DEBUG 
        read_i2c(sensor_addr, 0x2C, 0x06, recieve_data);
        DELAY(125000);  // 1ms待ち

        // 測定値の算出
        uint16_t ST = ((uint16_t)recieve_data[0] << 8) | recieve_data[1];
        uint16_t SRH = ((uint16_t)recieve_data[3] << 8) | recieve_data[4];

        // 温度
        int32_t temp_raw = -(45 << 16) + (175 * (int32_t)ST);
        int8_t temp_c = (int8_t)(temp_raw >> 16);  // 整数部分
        int8_t temp_frac = (int8_t)(((uint32_t)(temp_raw & 0xFFFF) * 10) >> 16);  // 小数部分

        // 湿度
        uint8_t humid = (uint8_t)((100 * (int32_t)SRH) >> 16);

        int2bin8(temp_c, bin1);
        int2bin8(temp_frac, bin2);
        int2bin8(humid, bin3);
        int2str(temp_c, buf_temp1);
        int2str(temp_frac, buf_temp2);
        int2str(humid, buf_humid);

        uart_send_str("Temperature: ");
        uart_send_str(bin1);
        uart_send_str(buf_temp1);
        uart_send_str("Humidity: ");
        uart_send_str(bin3);
        uart_send_str(buf_humid);

        uart_send_str("write character to monitor");        // DEBUG 

        // 温度記述
        write_i2c(monitor_addr, 0x00, (0x00 | 0x80));
        DELAY(2500);  // 20μs待機
        // 整数部
        for (int32_t i = 0; buf_temp1[i] != '\0'; i++)
        {
            write_i2c(monitor_addr, 0x40, buf_temp1[i]);
        }       
        DELAY(2500);  // 20μs待機
        write_i2c(monitor_addr, 0x40, 0x2E);  // 記号 .
        DELAY(2500);  // 20μs待機
        // 小数部
        for (int32_t i = 0; buf_temp2[i] != '\0'; i++)
        {
            write_i2c(monitor_addr, 0x40, buf_temp2[i]);
        }       
        DELAY(2500);  // 20μs待機
        // 記号 ゜
        write_i2c(monitor_addr, 0x40, 0xDF);        
        DELAY(2500);  // 20μs待機
        // 文字C
        write_i2c(monitor_addr, 0x40, 0x43);        
        DELAY(2500);  // 20μs待機
        
        // 湿度記述
        write_i2c(monitor_addr, 0x00, (0x40 | 0x80));
        DELAY(2500);  // 20μs待機
        for (uint32_t j = 0; buf_humid[j] != '\0'; j++)
        {
            write_i2c(monitor_addr, 0x40, buf_humid[j]);
        }
        DELAY(2500);  // 20μs待機
        // 記号％
        write_i2c(monitor_addr, 0x40, 0x25);

        DELAY(62500000);  // 500ms待ち
    }

    return 0;
}

//-------------------------------------------------------------------------
// 
// Copyright (c) 2025 grekichi
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------
//